let initialState = {
    conditions : {
        "1":`3. Камінь кинули вертикально вгору. В момент кидання, в т. А камінь мав 
        кінетичну енергію 30 Дж. Якою буде механічна енергія каменя в верхній точці В 
        траєкторії польоту? В точці кидання потенціальна енергія каменя рівна нулю. 
        Опором повітря знехтувати`,
        "2":`Віка побудувала вежу з кубиків. На малюнку зображено вигляд цієї вежі 
        зверху. Кожне число позначає кількість кубиків, покладених один на один у 
        відповідному стовпчику. Скільки кубиків необхідно докласти до цієї конструкції, 
        щоб отримати куб 5×5×5?`,
        "3":`5. Дві шестерні, на які намотано нитки і прикріплено вантажі, обертаються (див. 
            мал.). Вкажіть напрям і величину швидкості другого вантажу, якщо перший 
            рухається вгору зі швидкістю 15м/с (1-вгору,2-вниз).`,
        "4":`6.Скільки максимально слонів можна розставити на шаховій дошці,що не б’ють 
        один одного ,на крайні поля шахівниці,так щоб уздовж кожної сторони дошки 
        стояло порівно слонів`,
        "5":`7. Вода на 9 см не доходить до верхнього краю U-подібної трубки постійного 
        перерізу. В ліве коліно трубки потроху доливають гас (ρ = 800кг/м3 ). При якій 
        висоті стовпа гасу рідина почне витікати з трубки ?`
    },
    taskCount : 5,
}

const staticReducer = (state=initialState,action) => {
    switch (action.type){
        default:
            return state;
    }
}


export default staticReducer;